---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetSetIterator
source: html/f9c1082e-5ef2-2244-21a2-f0a86363c350.htm
---
# AssetSetIterator Properties

Identifies if the object is read-only or modifiable.